export const collectionList = [
  {
    category: 3,
    title: '诗经',
    desc: '最古老的诗集',
  },
  {
    category: 2,
    title: '论语',
    desc: '儒家经典',
  },
  {
    category: 1,
    title: '唐诗',
    desc: '优秀唐诗集锦',
  },
  {
    category: 0,
    title: '宋词',
    desc: '优秀宋词集锦',
  },
];

export const supList = [
  {
    id: 8011,
    category: 1,
    author: '李白',
    title: '行路难三首 一',
    content:
      '金樽清酒斗十千，玉盘珍羞直万钱。|停杯投筯不能食，拔剑四顾心茫然。|欲渡黄河冰塞川，将登太行雪满山。|闲来垂钓碧溪上，忽复乘舟梦日边。|行路难，行路难，多岐路，今安在。|长风破浪会有时，直挂云帆济沧海。',
  },
  {
    id: 11061,
    category: 1,
    author: '杜甫',
    title: '春望',
    content: '国破山河在，城春草木深。|感时花溅泪，恨别鸟惊心。|烽火连三月，家书抵万金。|白头搔更短，浑欲不胜簪。',
  },
  {
    id: 6015,
    category: 1,
    author: '王维',
    title: '山居秋暝',
    content: '空山新雨后，天气晚来秋。|明月松间照，清泉石上流。|竹喧归浣女，莲动下渔舟。|随意春芳歇，王孙自可留。',
  },
  {
    id: 7839,
    category: 1,
    author: '孟浩然',
    title: '过故人庄',
    content: '故人具鸡黍，邀我至田家。|绿树村边合，青山郭外斜。|开筵面场圃，把酒话桑麻。|待到重阳日，还来就菊花。',
  },
  {
    id: 9446,
    category: 1,
    author: '韦应物',
    title: '滁州西涧',
    content: '独怜幽草涧边生，上有黄鹂深树鸣。|春潮带雨晚来急，野渡无人舟自横。',
  },
  {
    id: 9669,
    category: 1,
    author: '岑参',
    title: '白雪歌送武判官归京',
    content: '北风卷地白草折，胡天八月即飞雪。|忽然一夜春风来，千树万树梨花开。|散入珠帘湿罗幕，狐裘不暖锦衾薄。|将军角弓不得控，都护铁衣冷难着。|瀚海阑干百丈冰，愁云黪淡万里凝。|中军置酒饮归客，胡琴琵琶与羌笛。|纷纷暮雪下辕门，风掣红旗冻不翻。|轮台东门送君去，去时雪满天山路。|山回路转不见君，雪上空留马行处。',
  },
  {
    id: 436,
    category: 0,
    author: '晏殊',
    title: '浣溪沙',
    content: '一曲新词酒一杯。|去年天气旧亭台。|夕阳西下几时回。|无可奈何花落去，似曾相识燕归来。|小园香径独徘徊。',
  },
  {
    id: 90,
    category: 0,
    author: '柳永',
    title: '雨霖铃',
    content: '寒蝉凄切。|对长亭晚，骤雨初歇。|都门帐饮无绪，留恋处、兰舟催发。|执手相看泪眼，竟无语凝噎。|念去去、千里烟波，暮霭沉沉楚天阔。|多情自古伤离别。|更那堪、冷落清秋节。|今宵酒醒何处，杨柳岸、晓风残月。|此去经年，应是良辰、好景虚设。|便纵有、千种风情，更与何人说。',
  },
  {
    id: 1460,
    category: 0,
    author: '苏轼',
    title: '水调歌头',
    content: '明月几时有，把酒问青天。|不知天上宫阙，今夕是何年。|我欲乘风归去，又恐琼楼玉宇，高处不胜寒。|起舞弄清影，何似在人间。|转朱阁，低绮户，照无眠。|不应有恨，何事长向别时圆。|人有悲欢离合，月有阴晴圆缺，此事古难全。|但愿人长久，千里共婵娟。',
  },
  {
    id: 11274,
    category: 0,
    author: '辛弃疾',
    title: '西江月',
    content: '明月别枝惊鹊，清风半夜鸣蝉。|稻花香里说丰年。|听取蛙声一片。|七八个星天外，两三点雨山前。|旧时茅店社林边。|路转溪桥忽见。',
  },
  {
    id: 6718,
    category: 0,
    author: '李清照',
    title: '声声慢',
    content: '寻寻觅觅，冷冷清清，凄凄惨惨戚戚。|乍暖还寒时候，最难将息。|三杯两盏淡酒，怎敌他、晚来风急。|雁过也，正伤心，却是旧时相识。|满地黄花堆积。|憔悴损，如今有谁摘。|守着窗儿，独自怎生得黑。|梧桐更兼细雨，到黄昏、点点滴滴。|这次第，怎一个、愁字了得。',
  },
  {
    id: 9849,
    category: 0,
    author: '陆游',
    title: '卜算子',
    content: '驿外断桥边，寂寞开无主。|已是黄昏独自愁，更着风和雨。|无意苦争春，一任群芳妒。|零落成泥碾作尘，只有香如故。',
  },
  {
    id: 3754,
    category: 0,
    author: '秦观',
    title: '鹊桥仙',
    content: '纤云弄巧，飞星传恨，银汉迢迢暗度。|金风玉露一相逢，便胜却、人间无数。|柔情似水，佳期如梦，忍顾鹊桥归路。|两情若是长久时，又岂在、朝朝暮暮。',
  },
  {
    id: 21927,
    category: 1,
    author: '白居易',
    title: '观刈麦',
    content: '田家少闲月，五月人倍忙。|夜来南风起，小麦覆陇黄。|妇姑荷箪食，童穉携壶浆。|相随饷田去，丁壮在南冈。|足蒸暑土气，背灼炎天光。|力尽不知热，但惜夏日长。|复有贫妇人，抱子在其傍。|右手秉遗穗，左臂悬敝筐。|听其相顾言，闻者为悲伤。|家田输税尽，拾此充饥肠。|今我何功德，曾不事农桑。|吏禄三百石，岁晏有余粮。|念此私自媿尽日不能忘。',
  },
  {
    id: 4397,
    category: 0,
    author: '周邦彦',
    title: '苏幕遮',
    content: '燎沈香，消溽暑。|鸟雀呼晴，侵晓窥檐语。|叶上初阳干宿雨，水面清圆，一一风荷举。|故乡遥，何日去。|家住吴门，久作长安旅。|五月渔郎相忆否。|小楫轻舟，梦入芙蓉浦。',
  },
];


